var DISCIPLINES_LIST = [
 '1 ин яз английский (4ч)',
 '1 ин яз английский (5ч)',
 '1 ин яз немецкий (4ч)',
 '1 ин яз немецкий (5ч)',
 '2 ин яз немецкий (2ч)',
 '2 ин. яз английский (2ч)',
 'алгебра (4ч)',
 'алгебра (база) (4ч)',
 'биология (1ч)',
 'биология (4ч)',
 'геогр (1ч)',
 'геометрия (2ч)',
 'геометрия (3ч)',
 'геометрия (база) (3ч)',
 'история. (2ч)',
 'история. (4ч)',
 'литература (3ч)',
 'обж (1ч)',
 'общ (1ч)',
 'общ (2ч)',
 'право (1ч)',
 'право (2ч)',
 'русский (3ч)',
 'физика (1ч)',
 'физика (3ч)',
 'физкультура (2ч)',
 'химия (1ч)',
 'химия (4ч)',
 'экономика (1ч)',
 'экономика (2ч)'
]

var CURRICULUMS = ['био','инж','эко','право','унив'];

var SPORTS = [
   "Шахматы",
   "Баскетбол",
   "Волейбол"
];

var MAX_STUDENTS = [15, 30];

var CLASS_NUMBERS = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11];

var HOURS = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

var DISCIPLINE_MODE = [ "базовый", "углубленный" ];

var DISCIPLINE_STATUS = [ "Обязательный", "Обязательный по выбору", "Дополнительный по выбору" ];

var CLASS_LETTERS = [
  'A', 
  'Б', 
  'В', 
  'Г', 
  'Д', 
  'E', 
  'Ж', 
  'З', 
  'И', 
  'К', 
  'Л', 
  'М', 
  'Н', 
  'О', 
  'П', 
  'Р', 
  'С', 
  'Т', 
  'У', 
  'Ф', 
  'Х', 
  'Ш',
  'Э', 
  'Ю', 
  'Я'
];


function getDisciplineId(disp) {
    for(var i = 0; i < getDisciplines().length; ++i) {
        if (getDisciplines()[i] === disp) {
            return i;
        }
    }
}