var DISCIPLINES_LIST = [
   "1 ин яз английский (4ч)",
"1 ин яз английский (5ч)",
"1 ин яз немецкий (4ч)",
"1 ин яз немецкий (5ч)",
"2 ин. яз 2ч (англ) (2ч)",
"алгебра (4ч)",
"астрономия (1ч)",
"био логия (1ч)",
"био логия (4ч)",
"геогр (1ч)",
"геометрия (2ч)",
"геометрия (3ч)",
"ист. (2ч)",
"ист. (4ч)",
"литература 3 (3ч)",
"анализ худ. произв (1ч)",
"обж 1 (1ч)",
"общ (1ч)",
"общ (2ч)",
"право (1ч)",
"право (2ч)",
"проект 2 (2ч)",
"русский 3 (3ч)",
"физ-ра (2ч)",
"физика (1ч)",
"химия (1ч)",
"химия (4ч)",
"экономика (1ч)",
"экономика (2ч)",
];

var CURRICULUMS = [
   "Физико-математический",
   "Химико-биологический",
   "Информатический",
   "Инженерный",
   "Гуманитарный"
];

var SPORTS = [
   "Шахматы",
   "Баскетбол",
   "Волейбол"
];

var MAX_STUDENTS = [15, 30];

var CLASS_NUMBERS = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11];

var HOURS = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

var DISCIPLINE_MODE = [ "базовый", "углубленный" ];

var DISCIPLINE_STATUS = [ "Обязательный", "Обязательный по выбору", "Дополнительный по выбору" ];

var CLASS_LETTERS = [
  'A', 
  'Б', 
  'В', 
  'Г', 
  'Д', 
  'E', 
  'Ж', 
  'З', 
  'И', 
  'К', 
  'Л', 
  'М', 
  'Н', 
  'О', 
  'П', 
  'Р', 
  'С', 
  'Т', 
  'У', 
  'Ф', 
  'Х', 
  'Ш',
  'Э', 
  'Ю', 
  'Я'
];

function getDisciplines() {
    return DISCIPLINES_LIST;
}

function getDisciplineId(disp) {
    for(var i = 0; i < DISCIPLINES_LIST.length; ++i) {
        if (DISCIPLINES_LIST[i] === disp) {
            return i;
        }
    }
}